Dlubal.RFEM5.LineReleaseType
Line release type parameters

Dlubal.RFEM5.LineReleaseType.No
Number

Dlubal.RFEM5.LineReleaseType.ID
Identifier

Dlubal.RFEM5.LineReleaseType.Comment
Comment

Dlubal.RFEM5.LineReleaseType.Tag
Tag

Dlubal.RFEM5.LineReleaseType.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.LineReleaseType.TranslationalConstantX
Translation release ux

Dlubal.RFEM5.LineReleaseType.TranslationalConstantY
Translation release uy

Dlubal.RFEM5.LineReleaseType.TranslationalConstantZ
Translation release uz

Dlubal.RFEM5.LineReleaseType.RotationalConstantX
Rotational release φx

Dlubal.RFEM5.LineReleaseType.TranslationalNonlinearityX
Nonlinearity in ux

Dlubal.RFEM5.LineReleaseType.TranslationalNonlinearityY
Nonlinearity in uy

Dlubal.RFEM5.LineReleaseType.TranslationalNonlinearityZ
Nonlinearity in uz

Dlubal.RFEM5.LineReleaseType.RotationalNonlinearityX
Nonlinearity in φx